In [2]:
# install mysql python connector
# Run only once 
#pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.1.0-cp310-cp310-win_amd64.whl (10.9 MB)
     ---------------------------------------- 10.9/10.9 MB 3.3 MB/s eta 0:00:00
Collecting protobuf<=4.21.12,>=4.21.1
  Downloading protobuf-4.21.12-cp310-abi3-win_amd64.whl (527 kB)
     -------------------------------------- 527.0/527.0 kB 2.5 MB/s eta 0:00:00
Installing collected packages: protobuf, mysql-connector-python
Successfully installed mysql-connector-python-8.1.0 protobuf-4.21.12
Note: you may need to restart the kernel to use updated packages.

In [1]:
# import necessary libraries
import mysql.connector
from mysql.connector import Error  # for finding the error
import pandas as pd                # for dataframe operations

In [2]:
# Creating a connection function to connect  with mysql,then use it  to create a database  
def set_sql_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print('mysql connection to python was successful')
    except Error as err:
        print(f'Error: {err}')
    return connection

In [3]:
# set connection to create database
user_password ='SUNshwsha1#'

connection=set_sql_connection('localhost','devuser',user_password)

mysql connection to python was successful

In [6]:
# Now we are creating  function to create new database in mysql
db= 'mysql_python'
def create_database(connection, query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        cursor.commit(query)
        print('database was successfully created')
    except Error as err:
        print(f'Error:{err}')
    finally:
        cursor.close()

In [5]:
#  using function to create database
create_database_query=""" create database mysql_python;"""
create_database(connection,create_database_query)

Error:1007 (HY000): Can't create database 'mysql_python'; database exists

In [27]:
# creating function to connect with the created database

def create_database_connection(host_name,user_name,user_password,database_name):
    connection=None
    try:
        connection=mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=database_name
        )
        print('connection to database was successful')
    except Error as err:
        print(f'Error: {err}')
    return connection

In [28]:
# establishing connection with the database
connection=create_database_connection('localhost','devuser',user_password,db)

connection to database was successful

In [33]:
# creating function to execute and commit query
def query_executor(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('query execution was successful')
    except Error as err:
        print(f'Error: {err}')

In [34]:
# Running the Query to create new table
query_1=''' create table students(id int primary key auto_increment, name varchar(50),marks int);'''
query_executor(connection,query_1)

query execution was successful

In [36]:
# running the  Query to insert values into the table created
query_2=''' insert into students(name,marks) values 
('shiva',80),('mukesh',90),('shivam',60),('x',70),('y',80),('z',90);
;'''
query_executor(connection,query_2)

query execution was successful

In [37]:
# creating function to read the data from mysql in python
def read_executor(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f'Error: {err}')

In [39]:
# reading the query output in python
query_3=''' select  * from students'''
results=read_executor(connection,query_3)
for result in results:
    print(result)

(1, 'shiva', 80)
(2, 'mukesh', 90)
(3, 'shivam', 60)
(4, 'x', 70)
(5, 'y', 80)
(6, 'z', 90)

In [44]:
# Put the result in form of a database:

columns=['Student_id','Student_name','Student_marks']
for_db =[]

for result in results:
    resutl=list(result)
    for_db.append(result)
    
df=pd.DataFrame(for_db,columns=columns)
display(df)

   Student_id Student_name  Student_marks
0           1        shiva             80
1           2       mukesh             90
2           3       shivam             60
3           4            x             70
4           5            y             80
5           6            z             90